tests/onEdgeSlopeAvalanche/Allrun
#!/bin/sh

# Create the mesh
blockMesh
makeFaMesh

python createInitialSlope.py

# create the intial time folder
cp -r 0_org 0

# Run sedExnerFoam
sedExnerFoam > log
